# ──────────────────────────────  网络结构  ──────────────────────────────
nc: 68

# depth_multiple: 0.25     # 原来 scales.n[0]
# width_multiple: 0.50     # 原来 scales.n[1]
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 512] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  # s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  # m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  # l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  # x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

anchors:
  - [4,5, 8,9, 13,11]          # P2/4
  - [18,20, 27,30, 34,35]      # P3/8
  - [46,48, 59,67, 78,86]      # P4/16
  - [103,110, 140,146, 192,199] # P5/32

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2,[256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2,[512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2,[512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2,[1024, True]]
  - [-1, 1, SPPF,[1024, 5]]

head:
  - [-1, 1, nn.Upsample,[None, 2, "nearest"]]
  - [[-1, 6], 1, Concat,[1]]
  - [-1, 2, C3k2,[512, False]]

  - [-1, 1, nn.Upsample,[None, 2, "nearest"]]
  - [[-1, 4], 1, Concat,[1]]
  - [-1, 2, C3k2,[256, False]]

  - [-1, 1, nn.Upsample,[None, 2, "nearest"]]
  - [[-1, 2], 1, Concat,[1]]
  - [-1, 3, C3k2,[128, False]]

  - [-1, 1, Conv,[128, 3, 2]]
  - [[-1, 15], 1, Concat,[1]]
  - [-1, 2, C3k2,[256, False]]

  - [-1, 1, Conv,[256, 3, 2]]
  - [[-1, 12], 1, Concat,[1]]
  - [-1, 2, C3k2,[512, False]]

  - [-1, 1, Conv,[512, 3, 2]]
  - [[-1, 9], 1, Concat,[1]]
  - [-1, 2, C3k2,[1024, True]]

  - [[18, 21, 24, 27], 1, Detect,[68]]
# ──────────────────────────────────────────────────────────────────────
